Revit 2024 API
CustomFieldData.GetCustomFieldId Method
 Gets an unique identifier of the custom field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public Guid GetCustomFieldId()
Visual Basic
Public Function GetCustomFieldId As Guid
Visual C++
public:
Guid GetCustomFieldId()
Return Value
 Returns an unique identifier of type of custom field.
See Also
CustomFieldData Class
Autodesk.Revit.DB Namespace